<script setup lang="ts">
</script>
<script lang="ts">
export default {
    data() {
        return {
            
        }
    },
    methods: {
        
    },
    mounted() {
        
    },
}
</script>
<template>
<section class="find_section">
<h1>Поездки на ваш выбор по самым низким ценам</h1>
<div class="inputs">
    <div class="input_div" style="border-radius: 20px;">
        <svg viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg" class="kirk-icon" role="img" ><title>Откуда</title><g color="var(--_1gzv7bhc)"><path fill-rule="evenodd" clip-rule="evenodd" d="M21 12C21 16.9706 16.9706 21 12 21C7.02944 21 3 16.9706 3 12C3 7.02944 7.02944 3 12 3C16.9706 3 21 7.02944 21 12ZM12 17C14.7614 17 17 14.7614 17 12C17 9.23858 14.7614 7 12 7C9.23858 7 7 9.23858 7 12C7 14.7614 9.23858 17 12 17Z" fill="currentColor"></path></g></svg>
        <input type="text" placeholder="Откуда">
    </div>
    <div class="input_div">
        <svg viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg" class="kirk-icon" role="img" ><title>Откуда</title><g color="var(--_1gzv7bhc)"><path fill-rule="evenodd" clip-rule="evenodd" d="M21 12C21 16.9706 16.9706 21 12 21C7.02944 21 3 16.9706 3 12C3 7.02944 7.02944 3 12 3C16.9706 3 21 7.02944 21 12ZM12 17C14.7614 17 17 14.7614 17 12C17 9.23858 14.7614 7 12 7C9.23858 7 7 9.23858 7 12C7 14.7614 9.23858 17 12 17Z" fill="currentColor"></path></g></svg>
        <input type="text" placeholder="Куда">
    </div>
    <div class="input_div date_div">
        <input type="date">
    </div>
    <div class="input_div input_number">
        <svg viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg" class="kirk-icon" role="img" aria-hidden="true"><g color="var(--_1gzv7bhc)"><path fill="currentColor" fill-rule="evenodd" d="M15.3348 7.41667c0 2.07071-1.6793 3.75003-3.75 3.75003-2.07072 0-3.75-1.67932-3.75-3.75003v-.83334c0-2.07071 1.67928-3.75 3.75-3.75 2.0707 0 3.75 1.67929 3.75 3.75v.83334Zm-8.33334 0C7.00146 9.94762 9.05385 12 11.5848 12c2.5309 0 4.5833-2.05238 4.5833-4.58333v-.83334C16.1681 4.05238 14.1157 2 11.5848 2 9.05385 2 7.00146 4.05238 7.00146 6.58333v.83334ZM20.3335 20.75v-1.7433c0-1.6904-1.1257-3.1725-2.7522-3.6154-2.0325-.5548-4.0791-.8913-5.9978-.8913-1.91873 0-3.96534.3365-5.99806.8914-1.6263.4428-2.75194 1.9249-2.75194 3.6153V20.75c0 .2301.18654.4167.41666.4167H19.9168c.2301 0 .4167-.1866.4167-.4167Zm-2.9714-4.5547c1.2631.344 2.1381 1.4959 2.1381 2.8114v1.3266H3.66683v-1.3266c0-1.3155.87493-2.4674 2.13781-2.8113 1.9672-.537 3.9441-.8621 5.77886-.8621 1.8347 0 3.8117.3251 5.7786.862Z" clip-rule="evenodd"></path></g></svg>
        <input type="number" min="1" max="4">
    </div>
    <button>Поиск</button>
</div>
</section>
<section class="params_section">

    <div class="param">
        <svg viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg" class="kirk-icon" role="img" aria-hidden="true"><g color="var(--_1gzv7bhc)"><path fill="currentColor" fill-rule="evenodd" d="M4.1865 3.64604c-.89101.4455-1.25175.96845-1.25175 1.39741s.36074.95191 1.25175 1.39741c.8611.43055 2.08569.71128 3.46564.71128 1.37996 0 2.60456-.28073 3.46566-.71128.891-.4455 1.2517-.96845 1.2517-1.39741s-.3607-.95191-1.2517-1.39741c-.8611-.43056-2.0857-.71129-3.46566-.71129-1.37995 0-2.60454.28073-3.46564.71129Zm-.44721-.89443c1.02722-.51361 2.41132-.81686 3.91285-.81686 1.50154 0 2.88566.30325 3.91286.81686.9973.49866 1.8045 1.28005 1.8045 2.29184 0 .01241-.0001.02478-.0003.03711.0002.00638.0003.01279.0003.01923v3.42172c0 .31775-.0796.61278-.2197.88346.9171-.32756 2.0213-.51367 3.1977-.51367 1.5015 0 2.8856.30324 3.9128.81685.9973.49865 1.8045 1.28005 1.8045 2.29185 0 .022-.0003.0439-.0011.0657.0008.0113.0011.0226.0011.0341v3.3783c0 .0225-.0004.045-.0011.0673.0007.0115.0011.0231.0011.0349v3.3763c0 1.0118-.8071 1.7932-1.8044 2.2918-1.0272.5136-2.4113.8168-3.9129.8168-1.5017 0-2.8858-.3032-3.913-.8168-.9973-.4986-1.8044-1.28-1.8044-2.2918v-.8116c-.8694.2823-1.88915.4417-2.97796.4417-1.50164 0-2.88575-.3032-3.91295-.8168-.99732-.4986-1.80444-1.28-1.80444-2.2918v-3.3783c0-.0114.00039-.0228.00114-.034-.00075-.0218-.00114-.0437-.00114-.0658V8.6203c0-.01133.00038-.02257.00112-.0337-.00074-.02159-.00112-.04329-.00112-.06509V5.09979c0-.00644.00013-.01285.00037-.01923-.00025-.01233-.00037-.0247-.00037-.03711 0-1.01179.80722-1.79318 1.80454-2.29184ZM21.0648 13.788c-.2421.1909-.5153.3592-.8045.5038-1.0272.5136-2.4113.8169-3.9128.8169-1.5016 0-2.8857-.3033-3.9129-.8169-.2892-.1446-.5624-.3129-.8045-.5038v1.6901c0 .429.3607.9519 1.2516 1.3974.8611.4305 2.0857.7112 3.4658.7112 1.38 0 2.6046-.2807 3.4657-.7112.8909-.4455 1.2516-.9684 1.2516-1.3974V13.788Zm-10.4336-1.7223c-.0008-.0218-.0011-.0437-.0011-.0657 0-.3177.0796-.6127.2197-.8834-.91707.3275-2.0213.5136-3.19766.5136-1.50164 0-2.88575-.3032-3.91295-.8168-.28914-.1446-.5623-.3129-.80444-.5037V12c0 .4291.36072.952 1.25165 1.3975.86106.4305 2.08565.7112 3.46574.7112 1.13906 0 2.16663-.192 2.97796-.5028v-1.5061c0-.0115.0004-.0228.0011-.0341Zm9.6292 5.7042c.2892-.1445.5623-.3129.8044-.5037v1.6904c0 .429-.3607.9519-1.2516 1.3974-.8611.4305-2.0857.7112-3.4657.7112-1.3801 0-2.6047-.2807-3.4658-.7112-.8909-.4455-1.2516-.9684-1.2516-1.3974v-1.6904c.2421.1908.5153.3592.8044.5037 1.0272.5136 2.4113.8168 3.913.8168 1.5016 0 2.8857-.3032 3.9129-.8168Zm-9.6303-2.2918c0 .0225.0004.045.0012.0673-.0008.0115-.0012.0231-.0012.0349v1.5046c-.81055.3104-1.83866.5018-2.97796.5018-1.38009 0-2.60468-.2807-3.46574-.7112-.89093-.4455-1.25165-.9684-1.25165-1.3974v-1.6899c.24214.1908.5153.3592.80444.5037 1.0272.5136 2.41131.8168 3.91295.8168 1.08921 0 2.10852-.16 2.97796-.4426v.812Zm.9349-8.14281c.2892-.14459.5624-.31294.8045-.5038v1.69002c0 .42905-.3607.95199-1.2516 1.39746-.8611.43053-2.08566.71123-3.46576.71123-1.38009 0-2.60468-.2807-3.46574-.71123-.89093-.44547-1.25165-.96841-1.25165-1.39746V6.83149c.24217.19086.51536.35921.80454.5038 1.02722.51361 2.41132.81685 3.91285.81685 1.50154 0 2.88566-.30324 3.91286-.81685ZM11.6301 12c0-.429.3607-.9519 1.2517-1.3974.8611-.4306 2.0857-.7113 3.4657-.7113 1.3799 0 2.6045.2807 3.4656.7113.891.4455 1.2517.9684 1.2517 1.3974 0 .4289-.3607.9519-1.2517 1.3974-.8611.4306-2.0857.7113-3.4656.7113-1.38 0-2.6046-.2807-3.4657-.7113-.891-.4455-1.2517-.9685-1.2517-1.3974Z" clip-rule="evenodd"></path></g></svg>
        <h2>Ваша поездка по низкой цене</h2>
        <h3>Куда бы вы ни собирались, на автобусе или с попутчиками, вы сможете 
            найти свою идеальную поездку среди множества маршрутов и доехать по самой низкой цене.</h3>
    </div>

    <div class="param">
        <svg viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg" class="kirk-icon" role="img" aria-hidden="true"><g color="var(--_1gzv7bhc)"><g><path d="M19.33,8.5c0-0.276-0.225-0.5-0.5-0.5h-3.855c-0.275,0-0.5,0.224-0.5,0.5s0.225,0.5,0.5,0.5h3.855 C19.105,9,19.33,8.776,19.33,8.5z"></path><path d="M9.906,8.492V8.133c0-0.994-0.798-1.799-1.781-1.799S6.344,7.139,6.344,8.133v0.359 c0,0.994,0.798,1.799,1.781,1.799S9.906,9.486,9.906,8.492z" fill="var(--_1gzv7bhc)"></path><path d="M4.167,13.422v0.528c0,0.165,0.134,0.3,0.3,0.3h7.316c0.166,0,0.3-0.135,0.3-0.3v-0.528 c0-0.713-0.474-1.339-1.162-1.526c-0.75-0.204-1.773-0.417-2.797-0.417s-2.047,0.213-2.797,0.417 C4.641,12.083,4.167,12.709,4.167,13.422z" fill="var(--_1gzv7bhc)"></path><path d="M12,18H1.982V1h2.904C5.11,2.139,6.086,3,7.265,3c1.178,0,2.154-0.861,2.379-2h4.88 c0.225,1.139,1.201,2,2.379,2s2.154-0.861,2.379-2h2.903v9c0,0.276,0.224,0.5,0.5,0.5s0.5-0.224,0.5-0.5V0.5 c0-0.276-0.224-0.5-0.5-0.5H18.83c-0.276,0-0.5,0.224-0.5,0.5c0,0.833-0.643,1.5-1.428,1.5s-1.428-0.667-1.428-1.5 c0-0.276-0.224-0.5-0.5-0.5H9.192c-0.276,0-0.5,0.224-0.5,0.5c0,0.833-0.643,1.5-1.427,1.5S5.837,1.333,5.837,0.5 c0-0.276-0.224-0.5-0.5-0.5H1.482c-0.276,0-0.5,0.224-0.5,0.5v18c0,0.276,0.224,0.5,0.5,0.5H12c0.276,0,0.5-0.224,0.5-0.5 S12.276,18,12,18z"></path><path d="M25.354,13.646c-0.195-0.195-0.512-0.195-0.707,0L19,19.293l-2.646-2.646c-0.195-0.195-0.512-0.195-0.707,0 s-0.195,0.512,0,0.707l3,3c0.195,0.195,0.512,0.195,0.707,0l6-6C25.549,14.158,25.549,13.842,25.354,13.646z"></path></g></g></svg>
        <h2>Доверяйте своим попутчикам</h2>
        <h3>Мы стараемся узнать ваших будущих попутчиков и автобусных перевозчиков как можно лучше. 
            Мы проверяем отзывы, профили и паспортные данные попутчиков, чтобы вы знали, с кем поедете.</h3>
    </div>

    <div class="param">
        <svg viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg" class="kirk-icon" role="img" aria-hidden="true"><g color="var(--_1gzv7bhc)"><path fill="currentColor" fill-rule="evenodd" d="M8.01762 2.36844C8.07695 2.15091 8.27453 2 8.5 2h7c.1569 0 .3047.07365.3992.1989.0945.12526.1247.2876.0816.43846L14.1629 9H19.5c.194 0 .3705.11223.4528.28792.0823.17569.0555.38313-.0687.53217L9.88411 21.8201c-.14928.1791-.40257.2313-.61049.1257-.20791-.1056-.31524-.3408-.25869-.5671L10.8596 14H5.5c-.15583 0-.30276-.0727-.39735-.1965-.09459-.1238-.12603-.2847-.08503-.4351l3-10.99996ZM8.8819 3 6.15463 13H11.5c.154 0 .2994.0709.3941.1923.0948.1214.1283.2796.091.429l-1.4699 5.8794L18.4325 10H13.5c-.1569 0-.3047-.07365-.3992-.1989-.0945-.12526-.1247-.2876-.0816-.43846L14.8371 3H8.8819Z" clip-rule="evenodd"></path></g></svg>
        <h2>В дорогу за пару кликов!</h2>
        <h3>Забронировать поездку проще простого. В нашем приложении легко разобраться: мощный алгоритм за 
            пару минут найдет водителя поблизости, и вам останется нажать пару кнопок для брони.</h3>
    </div>
</section>
<section class="create_section">
    <img src="../assets//images/driver-c3bdd70e6a29c6af9ef1.svg" alt="">
    <div class="text_part">
        <h1>Экономьте, когда вы за рулем</h1>
        <h3>Зарегистрируйте профиль водителя, берите попутчиков и экономьте на бензине. 
            Чтобы опубликовать первую поездку, нужно всего пару минут. Готовы ехать?</h3>
            <router-link to="/create">Опубликовать поездку</router-link>
    </div>
</section>
</template>

<style scoped lang="scss">
.find_section{
   background-image: url("https://cdn.blablacar.com/kairos/assets/images/carpool_coral_bus_large-78022c0488061d145a65.svg");
   background-repeat: no-repeat;
   background-position: center;
   background-size: cover;
   height: 15vw;
   display: flex;
   flex-direction: column;
   align-items: center;
   h1{
        color: #ffffff;
        font-family: "Exo 2"; 
        font-size: 36px;
   }
   .inputs{
    display: flex;
    justify-content: center;
    border-radius: 20px;
    box-shadow: 0px 0px 8px 0px rgb(95, 95, 95);
    .input_div{
        display: flex;
        align-items: center;
        background-color: #fff;
        width: 90%;
        .kirk-icon{
            height: 30px;
            color: #585858;
        }
    }
    .date_div{
       width: 20%;
       input{
           display: flex;
           flex-direction: row-reverse;
           align-items: center;
       }
    }
    .date_div input::-webkit-calendar-picker-indicator{
       height: 25px;
       width: 25px;
       margin-top: 7px;
    }
    .input_number{
       width: 20%;
   }
    input{
        outline: none;
        border: none;
        height: 50px;
        color: #585858;
        font-family: "Exo 2";
        font-size: 20px;
        font-weight: bold;
        width: 90%;
    }
    button{
        border: none;
        background-color: #00aeff;
        color: white;
        font-family: "Exo 2"; 
        font-size: 24px;
        width: 50%;
        border-top-right-radius: 20px;
        border-bottom-right-radius: 20px;
        cursor: pointer;
    }

}
}
.create_section{
    display: flex;
    justify-content: center;
    align-items: center;
    img{
        width: 30%;
    }
    .text_part{
        width: 30%;
        display: flex;
        flex-direction: column;
        justify-content: center;
        align-items: center;
        h1{
            width: 100%;
            margin: 0;
            margin-bottom: 20px;
            color: #23272e;
            font-family: "Exo 2";
        }
        h3{
            width: 100%;
            margin: 0;
            margin-bottom: 20px;
            color: #23272e;
            font-family: "Exo 2";
        }
        a{
            padding: 15px 40px;
            background-color: #00b7ff;
            border-radius: 30px;
            color: #ffffff;
            font-family: "Exo 2";
            text-decoration: none;
            font-size: 18px;
        }
    }
}
.params_section{
    display: flex;
    justify-content: center;
    margin-top: 30px;
    .param{
        display: flex;
        flex-direction: column;
        align-items: start;
        justify-content: start;
        width: 20%;
        margin: 20px;
        .kirk-icon{
            height: 50px;
            width: 50px;
        }
        h2{
            margin: 0;
            color: #23272e;
            font-family: "Exo 2";
        }
        h3{
            margin: 0;
            color: #818181;
            font-family: "Exo 2";
        }
    }
}
</style>